TexasInstruments/simplelink-lowpower-f2-sdk/source/ti/devices/cc13x1_cc26x1/inc/hw_cpu_scs.h
// Field: [21:19] TEX
//
// Type extension
#define CPU_SCS_MPU_RASR_TEX_W                                               3
#define CPU_SCS_MPU_RASR_TEX_M                                      0x00380000
#define CPU_SCS_MPU_RASR_TEX_S                                              19

// Field:    [18] S
//
// Shareable bit:
// 0: Not shareable
// 1: Shareable
#define CPU_SCS_MPU_RASR_S                                          0x00040000
#define CPU_SCS_MPU_RASR_S_BITN                                             18
#define CPU_SCS_MPU_RASR_S_M                                        0x00040000
#define CPU_SCS_MPU_RASR_S_S                                                18

// Field:    [17] C
//
// Cacheable bit:
// 0: Not cacheable
// 1: Cacheable
#define CPU_SCS_MPU_RASR_C                                          0x00020000
#define CPU_SCS_MPU_RASR_C_BITN                                             17
#define CPU_SCS_MPU_RASR_C_M                                        0x00020000
#define CPU_SCS_MPU_RASR_C_S                                                17

// Field:    [16] B
//
// Bufferable bit:
// 0: Not bufferable
// 1: Bufferable
#define CPU_SCS_MPU_RASR_B                                          0x00010000
#define CPU_SCS_MPU_RASR_B_BITN                                             16
#define CPU_SCS_MPU_RASR_B_M                                        0x00010000
#define CPU_SCS_MPU_RASR_B_S                                                16

// Field:  [15:8] SRD
//
// Sub-Region Disable field:
// Setting a bit in this field disables the corresponding sub-region. Regions
// are split into eight equal-sized sub-regions. Sub-regions are not supported
// for region sizes of 128 bytes and less.
#define CPU_SCS_MPU_RASR_SRD_W                                               8
#define CPU_SCS_MPU_RASR_SRD_M                                      0x0000FF00
#define CPU_SCS_MPU_RASR_SRD_S                                               8

// Field:   [5:1] SIZE
//
// MPU Protection Region Size Field:
// 0x04: 32B
// 0x05: 64B
// 0x06: 128B
// 0x07: 256B
// 0x08: 512B
// 0x09: 1KB
// 0x0A: 2KB
// 0x0B: 4KB
// 0x0C: 8KB
// 0x0D: 16KB
// 0x0E: 32KB
// 0x0F: 64KB
// 0x10: 128KB
// 0x11: 256KB
// 0x12: 512KB
// 0x13: 1MB
// 0x14: 2MB
// 0x15: 4MB
// 0x16: 8MB
// 0x17: 16MB
// 0x18: 32MB
// 0x19: 64MB
// 0x1A: 128MB
// 0x1B: 256MB
// 0x1C: 512MB
// 0x1D: 1GB
// 0x1E: 2GB
// 0x1F: 4GB
#define CPU_SCS_MPU_RASR_SIZE_W                                              5
#define CPU_SCS_MPU_RASR_SIZE_M                                     0x0000003E
#define CPU_SCS_MPU_RASR_SIZE_S                                              1

// Field:     [0] ENABLE
//
// Region enable bit:
// 0: Disable region
// 1: Enable region
#define CPU_SCS_MPU_RASR_ENABLE                                     0x00000001
#define CPU_SCS_MPU_RASR_ENABLE_BITN                                         0
#define CPU_SCS_MPU_RASR_ENABLE_M                                   0x00000001
#define CPU_SCS_MPU_RASR_ENABLE_S                                            0

//*****************************************************************************
//
// Register: CPU_SCS_O_MPU_RBAR_A1
//
//*****************************************************************************
// Field:  [31:0] MPU_RBAR_A1
//
// Alias for MPU_RBAR
#define CPU_SCS_MPU_RBAR_A1_MPU_RBAR_A1_W                                   32
#define CPU_SCS_MPU_RBAR_A1_MPU_RBAR_A1_M                           0xFFFFFFFF
#define CPU_SCS_MPU_RBAR_A1_MPU_RBAR_A1_S                                    0

//*****************************************************************************
//
// Register: CPU_SCS_O_MPU_RASR_A1
//
//*****************************************************************************
// Field:  [31:0] MPU_RASR_A1
//
// Alias for MPU_RASR
#define CPU_SCS_MPU_RASR_A1_MPU_RASR_A1_W                                   32
#define CPU_SCS_MPU_RASR_A1_MPU_RASR_A1_M                           0xFFFFFFFF
#define CPU_SCS_MPU_RASR_A1_MPU_RASR_A1_S                                    0

//*****************************************************************************
//
// Register: CPU_SCS_O_MPU_RBAR_A2
//
//*****************************************************************************
// Field:  [31:0] MPU_RBAR_A2
//
// Alias for MPU_RBAR
#define CPU_SCS_MPU_RBAR_A2_MPU_RBAR_A2_W                                   32
#define CPU_SCS_MPU_RBAR_A2_MPU_RBAR_A2_M                           0xFFFFFFFF
#define CPU_SCS_MPU_RBAR_A2_MPU_RBAR_A2_S                                    0

//*****************************************************************************
//
// Register: CPU_SCS_O_MPU_RASR_A2
//
//*****************************************************************************
// Field:  [31:0] MPU_RASR_A2
//
// Alias for MPU_RASR
#define CPU_SCS_MPU_RASR_A2_MPU_RASR_A2_W                                   32
#define CPU_SCS_MPU_RASR_A2_MPU_RASR_A2_M                           0xFFFFFFFF
#define CPU_SCS_MPU_RASR_A2_MPU_RASR_A2_S                                    0

//*****************************************************************************
//
// Register: CPU_SCS_O_MPU_RBAR_A3
//
//*****************************************************************************
// Field:  [31:0] MPU_RBAR_A3
//
// Alias for MPU_RBAR
#define CPU_SCS_MPU_RBAR_A3_MPU_RBAR_A3_W                                   32
#define CPU_SCS_MPU_RBAR_A3_MPU_RBAR_A3_M                           0xFFFFFFFF
#define CPU_SCS_MPU_RBAR_A3_MPU_RBAR_A3_S                                    0

//*****************************************************************************
//
// Register: CPU_SCS_O_MPU_RASR_A3
//
//*****************************************************************************
// Field:  [31:0] MPU_RASR_A3
//
// Alias for MPU_RASR
#define CPU_SCS_MPU_RASR_A3_MPU_RASR_A3_W                                   32
#define CPU_SCS_MPU_RASR_A3_MPU_RASR_A3_M                           0xFFFFFFFF
#define CPU_SCS_MPU_RASR_A3_MPU_RASR_A3_S                                    0

//*****************************************************************************
//
// Register: CPU_SCS_O_DHCSR
//
//*****************************************************************************
// Field:    [25] S_RESET_ST
//
// Indicates that the core has been reset, or is now being reset, since the
// last time this bit was read. This a sticky bit that clears on read. So,
// reading twice and getting 1 then 0 means it was reset in the past. Reading
// twice and getting 1 both times means that it is being reset now (held in
// reset still).
// When writing to this register, 0 must be written this bit-field, otherwise
// the write operation is ignored and no bits are written into the register.
#define CPU_SCS_DHCSR_S_RESET_ST                                    0x02000000
#define CPU_SCS_DHCSR_S_RESET_ST_BITN                                       25
#define CPU_SCS_DHCSR_S_RESET_ST_M                                  0x02000000
#define CPU_SCS_DHCSR_S_RESET_ST_S                                          25

// Field:    [24] S_RETIRE_ST
//
// Indicates that an instruction has completed since last read. This is a
// sticky bit that clears on read. This determines if the core is stalled on a
// load/store or fetch.
// When writing to this register, 0 must be written this bit-field, otherwise
// the write operation is ignored and no bits are written into the register.
#define CPU_SCS_DHCSR_S_RETIRE_ST                                   0x01000000
#define CPU_SCS_DHCSR_S_RETIRE_ST_BITN                                      24
#define CPU_SCS_DHCSR_S_RETIRE_ST_M                                 0x01000000
#define CPU_SCS_DHCSR_S_RETIRE_ST_S                                         24

